Конфигурация/Documents/ВыводКредитногоИнструмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВыводКредитногоИнструмента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыПредстоящихРасходов</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ВводыВыводыАктивовВВалютеУчета</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКредитныхИнструментах</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПроцентов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ДенежныеСредстваВКредитныхИнструментах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваВКредитныхИнструментах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКредитногоИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКредитныхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКредитногоИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКредитныхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/РезервыПредстоящихРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>РезервыПредстоящихРасходов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СубъектыАналитики</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ВводыВыводыАктивовВВалютеУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ВводыВыводыАктивовВВалютеУчета</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БалансоваяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РыночнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперацииВводаВыводаДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccountingRegisters/ЕдиныйБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccountingRegister>
		<Properties>
			<Name>ЕдиныйБухгалтерскийУчет</Name>
			<ChartOfAccounts>ChartOfAccounts.Единый</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОпераций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаДт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РасчетныеПоказателиДепозитногоВклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РасчетныеПоказателиДепозитногоВклада</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭффективнаяСтавкаПроцента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЭффективнаяПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЭффективнуюПроцентнуюСтавку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьПоЭффективнойПроцентнойСтавке</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДепозитныйВклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦельРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыКредитныхИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКредитныхИнструментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выданный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полученный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ВыводКредитногоИнструмента/Ext/ObjectModule.bsl
Процедура УстановитьБлокировки()
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах");
	
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("КредитныйИнструмент",          ЭтотОбъект.КредитныйИнструмент);

	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.УсловияКредитныхИнструментов");
	ЭлементБлокировкиДанных.УстановитьЗначение("КредитныйИнструмент",              ЭтотОбъект.КредитныйИнструмент);

	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.РезервыПредстоящихРасходов");
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                 	ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("СубъектАналитики",            	ЭтотОбъект.КредитныйИнструмент);
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ДенежныеСредстваВКредитныхИнструментах.Записывать 	= Истина;
	Движения.ВводыВыводыАктивовВВалютеУчета.Записывать      	= Истина;
	Движения.РезервыПредстоящихРасходов.Записывать				= Истина;

	// получим данные депозита и проверим их корректность
	ДанныеКредитногоИнструмента = РаботаСКредитнымиИнструментами.ПолучитьНоминалИДатуПогашенияКредитногоИнструмента(ЭтотОбъект);
	
	ЭтоДепозитныйВклад = ТипЗнч(ЭтотОбъект.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады");
	
	Если ДанныеКредитногоИнструмента.ТекущийНоминал <= 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Отсутствует текущий номинал "+?(ЭтоДепозитныйВклад, "депозитного вклада", "займа")+" " + ЭтотОбъект.КредитныйИнструмент + "!'"), ЭтотОбъект, "КредитныйИнструмент");
	КонецЕсли;
	
	Если ЭтоДепозитныйВклад И ЭтотОбъект.КредитныйИнструмент.ДоВостребования И НЕ ЗначениеЗаполнено(ДанныеКредитногоИнструмента.ДатаПогашения) Тогда
		//Для депозитов "до востребования" дата погашения не контролируется
	ИначеЕсли ДанныеКредитногоИнструмента.ДатаПогашения = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У "+?(ЭтоДепозитныйВклад, "депозитного вклада", "займа")+" " + ЭтотОбъект.КредитныйИнструмент + " не указана дата погашения ", ЭтотОбъект, "КредитныйИнструмент",, Отказ);
	Иначе
		Если ДанныеКредитногоИнструмента.ДатаПогашения < НачалоДня(ЭтотОбъект.Дата) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата документа " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + " не может быть больше даты погашения " + Формат(ДанныеКредитногоИнструмента.ДатаПогашения, "ДФ=dd.MM.yyyy"), ЭтотОбъект, "Дата",, Отказ);
		КонецЕсли; 
	КонецЕсли;	

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// денежные средства
	Движение = Движения.ДенежныеСредстваВКредитныхИнструментах.ДобавитьРасход();
	
	Движение.Период 					  = ЭтотОбъект.Дата;
	Движение.Организация 				  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Движение.КредитныйИнструмент		  = ЭтотОбъект.КредитныйИнструмент;
	Если ЭтоДепозитныйВклад Тогда
		Движение.ВидКредитногоИнструмента	  = Перечисления.ВидыКредитныхИнструментов.Выданный;
		Движение.ТипКредитногоИнструмента	  = Перечисления.ТипыКредитныхИнструментов.ДепозитныйВклад;
	Иначе
		Движение.ТипКредитногоИнструмента	  = Перечисления.ТипыКредитныхИнструментов.Займ;
		Движение.ВидКредитногоИнструмента	  = ЭтотОбъект.КредитныйИнструмент.ВидКредитногоИнструмента;
	КонецЕсли;
	Движение.Сумма                        = ДанныеКредитногоИнструмента.ТекущийНоминал;
	
	// вводы/выводы активов
	БалансоваяСтоимостьВВалютеУчета = РаботаСВалютами.ПолучитьСуммуДокументаВВалютеУчета(
		ДанныеКредитногоИнструмента.ТекущийНоминал + ЭтотОбъект.СуммаПроцентов, ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта, ЭтотОбъект, Отказ);
	
	Движение = Движения.ВводыВыводыАктивовВВалютеУчета.Добавить();
	
	Движение.НаправлениеДвижения		  = Перечисления.ВидыДвижений.Расход;
	Движение.Период						  = ЭтотОбъект.Дата;
	Движение.Организация				  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Если ЭтоДепозитныйВклад Тогда
		Движение.ВидАктива					  = Перечисления.ВидыАктивов.ДепозитныеВклады;
	Иначе
		Если ЭтотОбъект.КредитныйИнструмент.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Выданный Тогда
			Движение.ВидАктива					  = Перечисления.ВидыАктивов.ДебиторскаяЗадолженность;
		Иначе
			Движение.ВидАктива					  = Перечисления.ВидыАктивов.КредиторскаяЗадолженность;
		КонецЕсли;			
	КонецЕсли;
	Движение.РыночнаяСтоимость			  = БалансоваяСтоимостьВВалютеУчета;
	Движение.БалансоваяСтоимость		  = БалансоваяСтоимостьВВалютеУчета;			
	
	// резервы
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Дата КАК Период,
		|	РезервыПредстоящихРасходовОстатки.Организация КАК Организация,
		|	РезервыПредстоящихРасходовОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	РезервыПредстоящихРасходовОстатки.Резерв КАК Резерв,
		|	РезервыПредстоящихРасходовОстатки.СубъектАналитики КАК СубъектАналитики,
		|	РезервыПредстоящихРасходовОстатки.СуммаОстаток КАК Сумма,
		|	РезервыПредстоящихРасходовОстатки.Организация.ВалютаУчета КАК Валюта
		|ИЗ
		|	РегистрНакопления.РезервыПредстоящихРасходов.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И СубъектАналитики = &СубъектАналитики) КАК РезервыПредстоящихРасходовОстатки";
		
	Запрос.УстановитьПараметр("Период",							Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СубъектАналитики", 				ЭтотОбъект.КредитныйИнструмент);
	Запрос.УстановитьПараметр("Дата",			 				ЭтотОбъект.Дата);
	
	Движения.РезервыПредстоящихРасходов.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт

	Если ТипЗнч(ЭтотОбъект.КредитныйИнструмент) = Тип("СправочникСсылка.Займы") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализовано проведение по ЕПС закрытия займа", ЭтотОбъект.Ссылка,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Закрывать7ойРазделПриПоступленииДенежныхСредств = БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	// !!! в коде в вал. сумма заполнялась из реквизита ЭтотОбъект.Сумма, которого в документе нет
	// сейчас обращение к этому полю заменено на 0
	//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Формирование проводок по ЕПС в документе '" + ЭтотОбъект.Метаданные().Представление() + "' не поддерживается", ЭтотОбъект,,, Отказ);
	
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	УчетныйАктив = Справочники.ДепозитныеВклады.ОпределитьУчетныйАктивДепозита(ЭтотОбъект.КредитныйИнструмент, ЭтотОбъект.Дата);
	
	// *************** ТЕЛО ******************
	ДанныеДепозитногоВклада = РаботаСКредитнымиИнструментами.ПолучитьНоминалИДатуПогашенияКредитногоИнструмента(ЭтотОбъект);
	
	СуммаОперацииТелоДепозита = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ДанныеДепозитногоВклада.ТекущийНоминал, ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперацииТелоДепозита, "Вывод депозитного вклада");
	
	Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
	Проводка.СубконтоДт.Договоры = СчетДоверительногоУправления;
	
	Проводка.СчетКт = УчетныйАктив.СчетУчета;
	Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет;
	Проводка.СубконтоКт.ДепозитныеВклады = ЭтотОбъект.КредитныйИнструмент;
	Проводка.ВалютаКт  = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
	Проводка.ВалютнаяСуммаКт = ДанныеДепозитногоВклада.ТекущийНоминал;
	
	ОценочнаяСтоимость = РаботаСКредитнымиИнструментами.ПолучитьСтоимостьКредитногоИнструмента(ЭтотОбъект.КредитныйИнструмент, ЭтотОбъект.Дата, ЭтотОбъект.СчетДоверительногоУправления);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстаткиПроцентов.СуммаОстатокДт + ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт - БухгалтерскийУчетДоходыБудущихПериодов.СуммаОстатокКт КАК БалансоваяСуммаВВалютеУчета,
		|	БухгалтерскийУчетОстаткиПроцентов.СуммаОстатокДт КАК СуммаНачисленныхПроцентовВВалютеУчета,
		|	БухгалтерскийУчетОстаткиПроцентов.ВалютнаяСуммаОстатокДт + ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокДт - БухгалтерскийУчетДоходыБудущихПериодов.ВалютнаяСуммаОстатокКт КАК БалансоваяСумма,
		|	БухгалтерскийУчетОстаткиПроцентов.ВалютнаяСуммаОстатокДт КАК СуммаНачисленныхПроцентов,
		|	БухгалтерскийУчетДоходыБудущихПериодов.СуммаОстатокКт КАК СуммаДоходовБудущихПериодовВВалютеУчета,
		|	БухгалтерскийУчетДоходыБудущихПериодов.ВалютнаяСуммаОстатокКт КАК СуммаДоходовБудущихПериодов
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
		|				И Субконто1 = &ДепозитныйВклад) КАК БухгалтерскийУчетОстаткиПроцентов,
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты13),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
		|				И Субконто1 = &ДепозитныйВклад) КАК БухгалтерскийУчетДоходыБудущихПериодов,
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = &СчетУчетаДепозитов,
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДепозитныеВклады),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
		|				И ЛицевойСчет.ДепозитныйВклад = &ДепозитныйВклад) КАК ЕдиныйБухгалтерскийУчетОстатки";

	Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период",                       ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления));
	Запрос.УстановитьПараметр("ДепозитныйВклад",			  ЭтотОбъект.КредитныйИнструмент);
	Запрос.УстановитьПараметр("СчетУчетаДепозитов", 		  УчетныйАктив.СчетУчета);
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	ВалютаДепозитаОтличаетсяОтВалютыУчета = (ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта <> ЭтотОбъект.Организация.ВалютаУчета);
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		БалансоваяСумма 			= ?(ВалютаДепозитаОтличаетсяОтВалютыУчета, ВыборкаДетальныеЗаписи.БалансоваяСумма, ВыборкаДетальныеЗаписи.БалансоваяСуммаВВалютеУчета);
		СуммаНачисленныхПроцентов 	= ?(ВалютаДепозитаОтличаетсяОтВалютыУчета, ВыборкаДетальныеЗаписи.СуммаНачисленныхПроцентов, ВыборкаДетальныеЗаписи.СуммаНачисленныхПроцентовВВалютеУчета);
		СуммаДоходовБудущихПериодов = ?(ВалютаДепозитаОтличаетсяОтВалютыУчета, ВыборкаДетальныеЗаписи.СуммаДоходовБудущихПериодов, ВыборкаДетальныеЗаписи.СуммаДоходовБудущихПериодовВВалютеУчета);
		БалансоваяСуммаВВалютеУчета	= ВыборкаДетальныеЗаписи.БалансоваяСуммаВВалютеУчета;
		СуммаНачисленныхПроцентовВВалютеУчета = ВыборкаДетальныеЗаписи.СуммаНачисленныхПроцентовВВалютеУчета;	
		СуммаДоходовБудущихПериодовВВалютеУчета = ВыборкаДетальныеЗаписи.СуммаДоходовБудущихПериодовВВалютеУчета;
	Иначе
		БалансоваяСумма 			= 0;
		СуммаНачисленныхПроцентов 	= 0;
		СуммаДоходовБудущихПериодов = 0;
		БалансоваяСуммаВВалютеУчета	= 0;
		СуммаНачисленныхПроцентовВВалютеУчета = 0;
		СуммаДоходовБудущихПериодовВВалютеУчета = 0;
	КонецЕсли;
	
	// ЗЛО!!!
	СтоимостьПоДаннымБанка = ДанныеДепозитногоВклада.ТекущийНоминал + СуммаНачисленныхПроцентов - СуммаДоходовБудущихПериодов;
	ОтклонениеСтоимости = СтоимостьПоДаннымБанка - ОценочнаяСтоимость;
	Если ОтклонениеСтоимости > -1 И ОтклонениеСтоимости < 1 Тогда
		ОценочнаяСтоимость = СтоимостьПоДаннымБанка;
	КонецЕсли;
	// КОНЕЦ ЗЛА!!!	
		
	// Для валютных депозитов возможно возникновение курсовой разницы при выводе депозита. Разница остается на счете 20601.
	//Если ВалютаДепозитаОтличаетсяОтВалютыУчета Тогда
	//	
	//	КурсоваяРазница = БалансоваяСуммаВВалютеУчета - СуммаОперацииТелоДепозита;
	//	ВалютаКурсовойРазницы = ЭтотОбъект.ДепозитныйВклад.БанковскийСчет.Валюта;
	//	
	//	Если КурсоваяРазница <> 0 Тогда
	//		
	//		Если КурсоваяРазница > 0 Тогда
	//			
	//			// После вывода депозита на счете остались средства. 				
	//			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, КурсоваяРазница, "Списание курсовой разницы при выводе депозитного вклада");
	//			
	//			Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
	//			
	//			Если ВалютаКурсовойРазницы.Код = "840" Тогда // USD
	//				ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47201");
	//			ИначеЕсли ВалютаКурсовойРазницы.Код = "978" Тогда // EUR
	//				ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47202");
	//			Иначе
	//				ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47201"); // плохо, будем исправлять
	//			КонецЕсли;
	//			
	//			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУ;
	//			Проводка.СубконтоДт.ЦенныеБумаги = Справочники.БанковскиеСчета.ДенежныеСредстваВПути;
	//					
	//			Проводка.СчетКТ = УчетныйАктив.СчетУчета;
	//			Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.ДепозитныйВклад.БанковскийСчет;
	//			Проводка.СубконтоКт.ДепозитныеВклады = ЭтотОбъект.ДепозитныйВклад;
	//
	//			Проводка.ВалютаКт  = ВалютаКурсовойРазницы; 
	//		ИначеЕсли КурсоваяРазница < 0 Тогда
	//			  				
	//			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, -КурсоваяРазница, "Зачисление курсовой разницы при выводе депозитного вклада");
	//			
	//			Проводка.СчетДт = УчетныйАктив.СчетУчета;
	//			Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.ДепозитныйВклад.БанковскийСчет;
	//			Проводка.СубконтоДт.ДепозитныеВклады = ЭтотОбъект.ДепозитныйВклад;	
	//			Проводка.ВалютаДт  = ВалютаКурсовойРазницы;
	//			
	//			Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
	//	
	//			Если ВалютаКурсовойРазницы.Код = "840" Тогда // USD
	//				ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37201");
	//			ИначеЕсли ВалютаКурсовойРазницы.Код = "978" Тогда // EUR
	//				ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37202");
	//			Иначе
	//				ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37201"); // плохо, будем исправлять
	//			КонецЕсли;
	//			
	//			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУ;
	//			Проводка.СубконтоКт.ЦенныеБумаги = Справочники.БанковскиеСчета.ДенежныеСредстваВПути;

	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	ДоначислитьПроцентов = ОценочнаяСтоимость - БалансоваяСумма;
	ДоначислитьПроцентовВВалютеУчета = 0;
	
	Если ДоначислитьПроцентов <> 0 Тогда
		
		// доначислим %
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ДоначислитьПроцентов, ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		ДоначислитьПроцентовВВалютеУчета = СуммаОперации;

		
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Доначисление процентов по депозитному вкладу");
		
		Проводка.СчетДт = УчетныйАктив.СчетУчетаПереоценкиА;
		Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Банк.ЮрФизЛицо;
		Проводка.СубконтоДт.УсловияЗаймовКредитовИДепозитов = ЭтотОбъект.КредитныйИнструмент;
		Проводка.ВалютаДт  = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
		Проводка.ВалютнаяСуммаДт = ДоначислитьПроцентов;
		
		Проводка.СчетКт = ПланыСчетов.Единый.ПроцентныеДоходы01;
		Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаПроцентныхДоходов;
		Проводка.СубконтоКт.ЦенныеБумаги = ЭтотОбъект.КредитныйИнструмент;
		
	КонецЕсли;
	
	Если СуммаДоходовБудущихПериодов <> 0 Тогда
		
		СуммаЗакрытия = Мин(СуммаДоходовБудущихПериодов, ДоначислитьПроцентов);
		СуммаЗакрытияВВалютеУчета = Мин(СуммаДоходовБудущихПериодовВВалютеУчета, ДоначислитьПроцентовВВалютеУчета);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаЗакрытияВВалютеУчета, "Закрытие полученных процентов по депозитному вкладу");
		
		// дебет
		Проводка.СчетДт = ПланыСчетов.Единый.Депозиты13;
		Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет;
		Проводка.СубконтоДт.УсловияЗаймовКредитовИДепозитов = ЭтотОбъект.КредитныйИнструмент;
		Проводка.ВалютаДт  = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
		Проводка.ВалютнаяСуммаДт = СуммаЗакрытия;
		
		Проводка.СчетКт = УчетныйАктив.СчетУчетаПереоценкиА;
		Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Банк.ЮрФизЛицо;
		Проводка.СубконтоКт.УсловияЗаймовКредитовИДепозитов = ЭтотОбъект.КредитныйИнструмент;
		Проводка.ВалютаКт  = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
		Проводка.ВалютнаяСуммаКт = СуммаЗакрытия;
		
		СуммаДоходовБудущихПериодов = СуммаДоходовБудущихПериодов - СуммаЗакрытия;
		СуммаДоходовБудущихПериодовВВалютеУчета = СуммаДоходовБудущихПериодовВВалютеУчета - СуммаЗакрытияВВалютеУчета;
		ДоначислитьПроцентов = ДоначислитьПроцентов - СуммаЗакрытия;
		ДоначислитьПроцентовВВалютеУчета = ДоначислитьПроцентовВВалютеУчета - СуммаЗакрытияВВалютеУчета;
		
	КонецЕсли;
	
	СуммаНачисленныхПроцентов = СуммаНачисленныхПроцентов + ДоначислитьПроцентов;
	СуммаСписанныхНачисленныхПроцентовВВалютеУчета = 0;
	
	// Вывод всех ранее и сейчас начисленных процентов.
	Если СуммаНачисленныхПроцентов <> 0 Тогда
			
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаНачисленныхПроцентов, ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		СуммаСписанныхНачисленныхПроцентовВВалютеУчета = СуммаОперации;
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Вывод процентов по депозитному вкладу");
		
		Проводка.СчетДт 				= ПланыСчетов.Единый.АктивыВДУ03;
		Проводка.СубконтоДт.Договоры 	= СчетДоверительногоУправления;
		
		Проводка.СчетКт 				= УчетныйАктив.СчетУчетаПереоценкиА;
		Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Банк.ЮрФизЛицо;
		Проводка.СубконтоКт.УсловияЗаймовКредитовИДепозитов	= ЭтотОбъект.КредитныйИнструмент;
		Проводка.ВалютаКт  				= ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
		Проводка.ВалютнаяСуммаКт 		= СуммаНачисленныхПроцентов;
		
	КонецЕсли; 
	
 //   Если ВалютаДепозитаОтличаетсяОтВалютыУчета Тогда
 //   	
 //   	КурсоваяРазницаПроценты =  СуммаНачисленныхПроцентовВВалютеУчета + ДоначислитьПроцентовВВалютеУчета - СуммаСписанныхНачисленныхПроцентовВВалютеУчета;
 //   	ВалютаКурсовойРазницы = ЭтотОбъект.ДепозитныйВклад.БанковскийСчет.Валюта;
 //   	
 //   	Если КурсоваяРазницаПроценты <> 0 Тогда

 //   		Если КурсоваяРазницаПроценты > 0 Тогда
 //   			
 //   			
 //   			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, КурсоваяРазницаПроценты, "Списание курсовой разницы в начисленных процентах при выводе депозитного вклада");
 //   			
 //   			Проводка.СчетДт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций12;
 //   			
 //   			Если ВалютаКурсовойРазницы.Код = "840" Тогда // USD
 //   				ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47201");
 //   			ИначеЕсли ВалютаКурсовойРазницы.Код = "978" Тогда // EUR
 //   				ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47202");
 //   			Иначе
 //   				ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("47201"); // плохо, будем исправлять
 //   			КонецЕсли;
 //   			
 //   			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУ;
 //   			Проводка.СубконтоДт.ЦенныеБумаги = Справочники.БанковскиеСчета.ДенежныеСредстваВПути;  				
 //   			
 //   			Проводка.СчетКТ = УчетныйАктив.СчетУчетаПереоценкиА;
 //   			Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.ДепозитныйВклад.БанковскийСчет.Банк.ЮрФизЛицо;
 //   			Проводка.СубконтоКт.УсловияЗаймовКредитовИДепозитов = ЭтотОбъект.ДепозитныйВклад;
 //   			Проводка.ВалютаКт  = ВалютаКурсовойРазницы;				
 //
 //   		ИначеЕсли КурсоваяРазница < 0 Тогда
 //   			  				
 //   			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, -КурсоваяРазницаПроценты, "Зачисление курсовой разницы в начисленных процентах при выводе депозитного вклада");
 //   			
 //   			Проводка.СчетДт = УчетныйАктив.СчетУчетаПереоценкиА;
 //   			Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.ДепозитныйВклад.БанковскийСчет.Банк.ЮрФизЛицо;
 //   			Проводка.СубконтоДт.УсловияЗаймовКредитовИДепозитов = ЭтотОбъект.ДепозитныйВклад;
 //   			Проводка.ВалютаДт  = ВалютаКурсовойРазницы; 
 //   			
 //   			Проводка.СчетКт = ПланыСчетов.Единый.ДоходыРасходыОтОпераций11;
 //   	
 //   			Если ВалютаКурсовойРазницы.Код = "840" Тогда // USD
 //   				ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37201");
 //   			ИначеЕсли ВалютаКурсовойРазницы.Код = "978" Тогда // EUR
 //   				ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37202");
 //   			Иначе
 //   				ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("37201"); // плохо, будем исправлять
 //   			КонецЕсли;
 //   			
 //   			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = ГФУ;
 //   			Проводка.СубконтоКт.ЦенныеБумаги = Справочники.БанковскиеСчета.ДенежныеСредстваВПути;

 //   		КонецЕсли;
 //   		
 //   	КонецЕсли;
 //   	
 //   КонецЕсли;
	
	Если СуммаДоходовБудущихПериодов <> 0 Тогда
		
		//не перекурсовываем?
		//СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СуммаДоходовБудущихПериодов, ЭтотОбъект.ДепозитныйВклад.БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		//СуммаСписанныхНачисленныхПроцентовВВалютеУчета = СуммаОперации;
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаДоходовБудущихПериодовВВалютеУчета, "Вывод ранее полученных по депозитному вкладу");
		
		Проводка.СчетДт 				= ПланыСчетов.Единый.Депозиты13;
		Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет;
		Проводка.СубконтоДт.УсловияЗаймовКредитовИДепозитов	= ЭтотОбъект.КредитныйИнструмент;
		Проводка.ВалютаДт  				= ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
		Проводка.ВалютнаяСуммаДт 		= СуммаДоходовБудущихПериодов;
		
		Проводка.СчетКт 				= ПланыСчетов.Единый.АктивыВДУ03;
		Проводка.СубконтоКт.Договоры 	= СчетДоверительногоУправления;
		
	КонецЕсли;
	//**************************************************************
	Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
	
		БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУ(ЭтотОбъект, ПланыСчетов.Единый.ПроцентныеДоходы01, ЭтотОбъект.КредитныйИнструмент, ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта, "Закрытие доначисления процентов по депозитному вкладу");	
	
	КонецЕсли;
	//********************************************************************************
		
	РасчетныеДанныеДепозита = Новый Структура("ЭффективнаяСтавкаПроцента,ИспользоватьЭффективнуюПроцентнуюСтавку,СтоимостьПоЭффективнойПроцентнойСтавке", 0, Истина, СуммаОперацииТелоДепозита);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетныеПоказателиДепозитногоВкладаСрезПоследних.ЭффективнаяСтавкаПроцента КАК ЭффективнаяСтавкаПроцента,
		|	РасчетныеПоказателиДепозитногоВкладаСрезПоследних.ИспользоватьЭффективнуюПроцентнуюСтавку КАК ИспользоватьЭффективнуюПроцентнуюСтавку,
		|	РасчетныеПоказателиДепозитногоВкладаСрезПоследних.СтоимостьПоЭффективнойПроцентнойСтавке КАК СтоимостьПоЭффективнойПроцентнойСтавке
		|ИЗ
		|	РегистрСведений.РасчетныеПоказателиДепозитногоВклада.СрезПоследних(
		|			&Период,
		|			ДепозитныйВклад = &ДепозитныйВклад
		|				И ЦельРасчета = &ЦельРасчета) КАК РасчетныеПоказателиДепозитногоВкладаСрезПоследних";
	
	Запрос.УстановитьПараметр("ДепозитныйВклад", ЭтотОбъект.КредитныйИнструмент);
	Запрос.УстановитьПараметр("ЦельРасчета", Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РасчетныеДанныеДепозита, ВыборкаДетальныеЗаписи);
	КонецЕсли;

	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		УчетныйАктив,
		УчетныйРегистр);		
	
	Если РасчетныеДанныеДепозита.ИспользоватьЭффективнуюПроцентнуюСтавку Тогда
		
		БухгалтерскийУчетЕПС.ПровестиКорректировкуЭСП(ЭтотОбъект, ЭтотОбъект.КредитныйИнструмент, 0, 0);
	
	КонецЕсли;
	
	БухгалтерскийУчетЕПС.ПереоценитьВалютныеАктивы(ЭтотОбъект, Отказ);
	
	БухгалтерскийУчетЕПС.ЗакрытьКорректировки206(ЭтотОбъект, ЭтотОбъект.КредитныйИнструмент);	
	
	Если РасчетныеДанныеДепозита.ИспользоватьЭффективнуюПроцентнуюСтавку И Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
		БухгалтерскийУчетЕПС.ЗакрытьКорректировки710(ЭтотОбъект, ЭтотОбъект.КредитныйИнструмент);
	КонецЕсли;
	
	Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда // закроем корректировку ПП
		БухгалтерскийУчетЕПС.ЗакрытьКорректировки710(ЭтотОбъект, ЭтотОбъект.КредитныйИнструмент,,,, Ложь);
	КонецЕсли;
	
	БухгалтерскийУчетЕПС.ЗакрытьПарныеСчетаДоходовРасходов(ЭтотОбъект, УчетныйАктив, Ложь, Истина, ЭтотОбъект.КредитныйИнструмент, Отказ);	
	
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт

	Если ТипЗнч(ЭтотОбъект.КредитныйИнструмент) = Тип("СправочникСсылка.Займы") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализовано проведение по бухучету закрытия займа", ЭтотОбъект.Ссылка,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	СчетРасчетов = БухгалтерскийУчет.ОпределитьСчетРасчетовПоДоговоруДоверительногоУправления(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		Неопределено);
		
	ЕстьСубконтоКонтрагенты = (СчетРасчетов.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено);
	
	Если ЕстьСубконтоКонтрагенты Тогда
		КонтрагентДляПроводок = РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицоСчетаДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата);
	КонецЕсли;
		
	СчетУчетаАктивов = БухгалтерскийУчет.ОпределитьСчетУчетаАктивов(
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		Справочники.УчетныеАктивы.ДепозитныеВклады,
		УчетныйРегистр);
		
	СчетУчетаПереоценкиАктивов = БухгалтерскийУчет.ОпределитьСчетУчетаПереоценкиАктивов(
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		Справочники.УчетныеАктивы.ДепозитныеВклады,
		УчетныйРегистр);
	
	ДанныеДепозитногоВклада = РаботаСКредитнымиИнструментами.ПолучитьНоминалИДатуПогашенияКредитногоИнструмента(ЭтотОбъект);
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ДанныеДепозитногоВклада.ТекущийНоминал, "Вывод депозитного вклада");
	
	// Дебет
	Проводка.СчетДт = СчетРасчетов;	
	
	Если ЕстьСубконтоКонтрагенты Тогда
		Проводка.СубконтоДт.Контрагенты = КонтрагентДляПроводок;
	КонецЕсли;
	
	// Кредит
	Проводка.СчетКт = СчетУчетаАктивов;
	Проводка.СубконтоКт.ДепозитныеВклады = ЭтотОбъект.КредитныйИнструмент;
																  
	Если ЭтотОбъект.СуммаПроцентов <> 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ЭтотОбъект.СуммаПроцентов, "Вывод процентов по депозитному вкладу");
		
		// Дебет
		Проводка.СчетДт = СчетРасчетов;	
		
		Если ЕстьСубконтоКонтрагенты Тогда
			Проводка.СубконтоДт.Контрагенты = КонтрагентДляПроводок;
		КонецЕсли;
		
		// Кредит
		Проводка.СчетКт = СчетУчетаПереоценкиАктивов;
		Проводка.СубконтоКт.ДепозитныеВклады = ЭтотОбъект.КредитныйИнструмент;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "КредитныйИнструмент, СуммаПроцентов");
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.Дата >= РаботаСДокументами.ДатаНачалаПроверкиЗаполненияКонтрагента() Тогда
		ПроверяемыеРеквизиты.Добавить("Контрагент");
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
	
		Если Не ЗначениеЗаполнено(ЭтотОбъект.Контрагент) И ЭтотОбъект.Дата >= РаботаСДокументами.ДатаНачалаПроверкиЗаполненияКонтрагента() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено значение реквизиита [Контрагент]!", ЭтотОбъект, "Контрагент",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
    РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
